In [1]:
import pandas as pd

In [2]:
df= pd.read_excel("testdata/101_Demo_Data.xlsx", sheet_name="Data")

In [17]:
df.columns.to_list()

['Auth_ID', 'Date', 'Customer_ID']

In [4]:
df[0:10]

   Auth_ID       Date  Customer_ID
0  9000001 2019-01-01      1254644
1  9000002 2019-01-01      1728862
2  9000003 2019-01-01      4658401
3  9000004 2019-01-04      4345648
4  9000005 2019-01-05      3227045
5  9000006 2019-01-06      4082725
6  9000007 2019-01-07      1449803
7  9000008 2019-01-08      1268702
8  9000009 2019-01-09      4146040
9  9000010 2019-01-09      3966370

In [5]:
df.sort_values('Date', axis=0, ascending=False, inplace=True)
df[0:10]

     Auth_ID       Date  Customer_ID
180  9000181 2019-06-30      2762515
179  9000180 2019-06-29      2348607
178  9000179 2019-06-28      2016665
177  9000178 2019-06-27      3795312
176  9000177 2019-06-26      2654392
175  9000176 2019-06-25      3325220
174  9000175 2019-06-24      3613779
173  9000174 2019-06-23      2499470
172  9000173 2019-06-22      2487039
171  9000172 2019-06-21      1895972

This is not the best way to test for duplicates, but can do the trick

In [19]:
df2= df.groupby(["Auth_ID"], as_index = False ).count()
# If you dont include the as_index, the DF will have nested indexes, so to get the data use:
# list= df2.index.get_level_values(1).tolist() 
df2[df2.Date>1]

    Auth_ID  Date  Customer_ID
18  9000019     2            2

In [23]:
df2.sort_values('Date', axis=0, ascending=False, inplace=True)
df2[0:10]

    Auth_ID  Date  Customer_ID
18  9000019     2            2
23  9000025     1            1
10  9000011     1            1
2   9000003     1            1
3   9000004     1            1
4   9000005     1            1
5   9000006     1            1
6   9000007     1            1
7   9000008     1            1
8   9000009     1            1

In [24]:
df2.to_excel("output/101_Output_Grouped.xlsx", sheet_name='Grouped')